# -*- coding: utf-8 -*-

import os, sys
cat = os.path.join
    
import reportlab.rl_config
reportlab.rl_config.warnOnMissingFontGlyphs = 0
from reportlab.rl_config import TTFSearchPath
TTFSearchPath.append(cat(os.path.dirname(__file__), 'res', 'fonts'))
from reportlab.pdfgen import canvas
from reportlab.lib.units import mm
from reportlab.pdfbase import pdfmetrics
from reportlab.pdfbase.ttfonts import TTFont
pdfmetrics.registerFont(TTFont('wtm', 'WT021.TTF'))
pdfmetrics.registerFont(TTFont('msjh', 'msjh.ttf'))
#pdfmetrics.registerFont(TTFont('ming', 'mingliu.ttc'))
A4_w, A4_h = 210, 297
from reportlab.platypus import Paragraph, Frame, KeepInFrame
from reportlab.lib.styles import getSampleStyleSheet

def print_test_pdf():   
    f = cat(os.path.dirname(__file__), 'test.pdf')
    cv = canvas.Canvas(f)

    def line(l, cv):
        cv.line(*tuple([l[0]*mm, (A4_h - l[1])*mm, l[2]*mm, (A4_h - l[3])*mm]))

    def text(s, cv, size=9, font='wtm', centered=False):
        cv.setFont(font, size)
        f = cv.drawCentredString if centered else cv.drawString        
        f(*(s[0]*mm, (A4_h - s[1])*mm, unicode(s[2])))

    def rect(s, cv, fill=0):
        cv.rect(s[0]*mm, (A4_h - s[1])*mm, 3*mm, 3*mm, fill=fill)

    def referral_form(cv):
        cv.setLineWidth(1*mm)
        cv.rect(8*mm, 12*mm, 192*mm, 265*mm) 

        cv.setLineWidth(0.1*mm)

        lines = [
            (8,   20,  200,   20),    
            (8,   285, 200,  285),
            (8,   20,    8,  285),
            (200, 20,  200,  285),
            
            (14,  20,  14,   285),
            (20,  20,  20,   285),

            (8,   192, 200,  192),
            
            (20,  29,  200,   29),
            (20,  38,  200,   38),
            (20,  47,  200,   47),
            (14,  56,  200,   56),
            
            (63,  20,  63,    56),
            (110, 20,  110,   56),
            (155, 20,  155,   38),

            (14,  135, 200,  135),    
            (14,  154, 200,  154),            
            (14,  173, 200,  173),            
            (14,  214, 200,  214),
            (14,  267, 200,  267),

            (63,  135,  63,  154),
            (69,  135,  69,  154),
            (155, 135, 155,  154),
            (161, 135, 161,  154),
            
            (110, 135, 110,  192),
            (116, 135, 116,  192),
             
            (63,  267,  63,  285),
            (69,  267,  69,  285),
            (110, 267, 110,  285),
            (116, 267, 116,  285),
            (155, 267, 155,  285),
            (161, 267, 161,  285),

        ]
        for s in lines:
            line(s, cv)

        s = [
            (9, 25,  u'轉'),
            (9, 80,  u'出'),
            (9, 135, u'院'),            
            (9, 190, u'所'),

            (9, 197, u'轉'),
            (9, 226, u'入'),
            (9, 255, u'院'),            
            (9, 283, u'所'),
    
            (15, 25, u'被'),
            (15, 29, u'保'),
            (15, 33, u'險'),
            (15, 37, u'人'),
            (15, 41, u'基'),
            (15, 45, u'本'),
            (15, 49, u'資'),
            (15, 53, u'料'),
            
            (15, 60,  u'病'),
            (15, 84,  u'歷'),
            (15, 108, u'摘'),
            (15, 133, u'要'),

            (15, 140, u'診'),
            (15, 144, u'治'),
            (15, 148, u'醫'),
            (15, 152, u'師'),

            (64, 140, u'醫'),
            (64, 144, u'師'),
            (64, 148, u'簽'),
            (64, 152, u'章'),

            (111, 140, u'轉'),
            (111, 144, u'診'),
            (111, 148, u'目'),            
            (111, 152, u'的'),

            (156, 140, u'聯'),
            (156, 144, u'絡'),
            (156, 148, u'方'),            
            (156, 152, u'式'),

            (15, 159, u'轉'),
            (15, 163, u'診'),
            (15, 167, u'院'),
            (15, 171, u'所'),

            (15, 178, u'轉'),
            (15, 182, u'診'),
            (15, 186, u'日'),
            (15, 190, u'期'),

            (15, 197, u'處'),
            (15, 202, u'理'),
            (15, 207, u'情'),
            (15, 212, u'形'),
            
            (15, 219, u'治'),
            (15, 234, u'療'),
            (15, 249, u'摘'),
            (15, 265, u'要'),

            (15, 271, u'診'),
            (15, 275, u'治'),
            (15, 279, u'醫'),            
            (15, 283, u'師'),

            (64, 271, u'科'),
            (64, 283, u'別'),

            (111, 159, u'地'),
            (111, 163, u'址'),
            (111, 167, u'電'),            
            (111, 171, u'話'),

            (111, 178, u'開'),
            (111, 182, u'單'),
            (111, 186, u'日'),            
            (111, 190, u'期'),

            (111, 271, u'醫'),
            (111, 275, u'師'),
            (111, 279, u'簽'),            
            (111, 283, u'章'),

            (156, 271, u'回'),
            (156, 275, u'覆'),
            (156, 279, u'日'),            
            (156, 283, u'期'),

            (202,  24,   u'第'),
            (202,  28,   u'一'),
            (202,  32,   u'聯'),
            (202,  36,   u'：'),
            (202,  40,   u'轉'), 
            (202,  44,   u'入'),
            (202,  48,   u'院'),
            (202,  52,   u'所'), 
            (202,  56,   u'留'),
            (202,  60,   u'存'),
            (202,  64,   u'。'),

            (202,  72,   u'第'),
            (202,  76,   u'二'),
            (202,  80,   u'聯'),
            (202,  84,   u'：'),
            (202,  88,   u'轉'),
            (202,  92,   u'入'),
            (202,  96,   u'院'), 
            (202, 100,   u'所'),
            (202, 104,   u'回'),
            (202, 108,   u'覆'), 
            (202, 112,   u'轉'),
            (202, 116,   u'出'),
            (202, 120,   u'院'),
            (202, 124,   u'所'), 
            (202, 128,   u'。'), 
            
            (202, 136,   u'第'),
            (202, 140,   u'三'),
            (202, 144,   u'聯'),
            (202, 148,   u'：'),
            (202, 152,   u'轉'),
            (202, 156,   u'出'),
            (202, 160,   u'院'),
            (202, 164,   u'所'),
            (202, 168,   u'留'), 
            (202, 172,   u'存'), 
            (202, 176,   u'。'),
        ]
        for ss in s:
            text(ss, cv, size=12)
            
        s = [
            (10,  289,   u'本轉診單限使用一次'),
            
            (21,  25.5, u'姓'),
            (58,  25.5, u'名'),

            (65,  25.5, u'性'),
            (104, 25.5, u'別'),

            (112, 25.5, u'出'),
            (125, 25.5, u'生'),
            (137, 25.5, u'日'),
            (150, 25.5, u'期'),

            (157, 25.5, u'身'),
            (170, 25.5, u'份'),
            (182, 25.5, u'證'),
            (195, 25.5, u'號'),

            (21,  43.5, u'聯'),
            (40,  43.5, u'絡'),
            (58,  43.5, u'人'),

            (65,  43.5, u'聯'),
            (78,  43.5, u'絡'),
            (91,  43.5, u'電'),
            (104, 43.5, u'話'),

            (112, 43.5, u'聯'),
            (140, 43.5, u'絡'),
            (167, 43.5, u'地'),
            (195, 43.5, u'址'),

            (25, 197, u'已予急診處置，並轉診至'),
            (25, 202, u'已安排本院'),
            (25, 207, u'已予適當處置並轉回原院所。建議事項如下：'),
        ]
        for ss in s:
            text(ss, cv, size=12)

        rect((21, 197), cv)
        rect((21, 202), cv)
        rect((21, 207), cv)

        text((105, 10, u'全民健康保險轉診單'), cv, size=20, centered=True)
        text((105, 18, u'轉診至'), cv, size=18, centered=True)
        
    typ = (u'急診治療', u'門診治療', u'住院治療', u'進一步檢查', u'轉出至適當院所繼續追蹤', u'其他')

    def referral(cv):
        s = [
            (21,   34.5,  u'魏筱筠'),      # 姓名
            (65,   34.5,  u'女'),          # 性別
            (112,  34.5,  '101-06-20'),    # 出生日期 
            (157,  34.5,  'R220154944'),   # 身份證號
            (21,   52.5,  u'魏媽媽'),      # 聯絡人
            (65,   52.5,  '0920100200'),   # 聯絡電話
            (112,  52.5,  u'台南市新營區民權路 30-1 號'), # 聯絡住址 
            (21,   142,   u'魏筱筠'),     # 診治醫師 
            (21,   150,   u'婦產科'),     # 診治醫師（科別） 

            #(21,   104,  '105-05-14'),  # 聯絡方式 
            #(21,   104,  '105-05-14'),  # 轉診院所 
            #(21,   104,  '105-05-14'),  # 地址電話 
            #(21,   104,  '105-05-20'),  # 轉診日期
            #(118,  104,  '105-05-15'),  # 開單日期
        ]
        for ss in s:
            text(ss, cv, size=12, font='msjh')
    
        text((43, 18, u'惠生婦產科診所'), cv, size=18)
        text((8, 18, u'3521011033'), cv, size=16, font='msjh')

    referral_form(cv)
    referral(cv)

    style_sheet = getSampleStyleSheet()
    style = style_sheet['Normal']
    style.fontName = 'msjh'
    style.fontSize = 12 
    style.leading =  14
    
    frame1 = Frame(19*mm, 191*mm, 182*mm, 51*mm, showBoundary=0)
    s1 = u'''為提倡有科學根基的服務精神，中央氣象局依照職掌業務的範疇舉辦「天地人學思論壇」，邀請國內外具有國際聲望與影響力的學者分享其學術及人生的寶貴經驗，期能達到「天地人」和「學思論」分別呈現氣象局職掌業務與活動內容，藉由聆聽、討論、學習過程，擴大思考層面，深化科學涵養。活動相關訊息請參閱海報，竭誠歡迎大家報名參加。另「104年天地人學思論壇」產出的「氣象老先覺」專題電子版連結網址請「點此進入」，歡迎大家上網點閱，謝謝。為提倡有科學根基的服務精神，中央氣象局依照職掌業務的範疇舉辦「天地人學思論壇」，邀請國內外具有國際聲望與影響力的學者分享其學術及人生的寶貴經驗，期能達到「天地人」和「學思論」分別呈現氣象局職掌業務與活動內容，藉由聆聽、討論、學習過程，擴大思考層面，深化科學涵養。活動相關訊息請參閱海報，竭誠歡迎大家報名參加。另「104年天地人學思論壇」產出的「氣象老先覺」專題電子版連結網址請「點此進入」，歡迎大家上網點閱，謝謝。'''  
    soap1 = [Paragraph(s1, style)]
    soap_in_frame1 = KeepInFrame(182*mm, 51*mm, soap1)
    frame1.addFromList([soap_in_frame1,], cv)
    
    # 轉診目的
    frame2 = Frame(116*mm, 143*mm, 41*mm, 16*mm, showBoundary=0)
    s2 = typ[2]  
    soap2 = [Paragraph(s2, style)]
    soap_in_frame2 = KeepInFrame(41*mm, 16*mm, soap2)
    frame2.addFromList([soap_in_frame2,], cv)

    cv.save()

print_test_pdf()
